# Machine Learning Project - Personalized Loan Demand

# importing the libraries

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

# Load the dataset into the pandas dataframe
- 1 load the train data set and test data set into the pandas dataframe

In [6]:
df_train =pd.read_csv('Dataset/Train.csv')
df_test= pd.read_csv('Dataset/Test.csv')
df_train.head()

   YearlyIncome LoanPurpose  CreditRating  RequestedLoanAmount
0        189176    Business           480         50028.840100
1        172768    Business           774         28613.450092
2         59305    Personal           672         57138.880019
3         31308    Business           578          4687.380052
4         52212        Home           400         26460.830079

# Analysing the data by using the pandass library

In [7]:
df_test.head()

   YearlyIncome LoanPurpose  CreditRating  RequestedLoanAmount
0        151304         Car           495                  NaN
1         86788    Business           636                  NaN
2         64757    Personal           602                  NaN
3         67540    Personal           715                  NaN
4         42555    Personal           432                  NaN

In [8]:
df_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14700 entries, 0 to 14699
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   YearlyIncome         14700 non-null  int64
 1   LoanPurpose          14700 non-null  object
 2   CreditRating         14700 non-null  int64
 3   RequestedLoanAmount  14700 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 459.5+ KB

In [9]:
df_train.describe()

        YearlyIncome  CreditRating  RequestedLoanAmount
count   14700.000000  14700.000000         14700.000000
mean   109886.832381    576.229456         32978.126907
std     52099.376488    160.302444         18467.196486
min     20231.000000    300.000000          1013.000037
25%     64688.750000    436.000000         16975.435016
50%    109874.500000    577.000000         32984.760068
75%    155149.500000    717.000000         48968.515059
max    199945.000000    849.000000         64948.000025

In [10]:
df_train.shape

(14700, 4)

# checking the duplicates in the dataset by using the duplicated() function

In [11]:
df_train.duplicated().sum()

np.int64(0)

In [12]:
df_test.duplicated().sum()

np.int64(0)

# finddingthe missing values in the dataset by using the isnull() function

In [13]:
df_train.isnull().sum()

YearlyIncome           0
LoanPurpose            0
CreditRating           0
RequestedLoanAmount    0
dtype: int64

In [14]:
df_test.isnull().sum()

YearlyIncome             0
LoanPurpose              0
CreditRating             0
RequestedLoanAmount    300
dtype: int64

understanding the data by using the visualization tools here we using the seabo